; ModuleID = 'netmanager_kern.c'
source_filename = "netmanager_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.11 = type { [14 x i32]*, i32*, i32*, [256 x i32]* }
%struct.anon.15 = type { [1 x i32]*, %struct.conn_ipv4_key*, %struct.conn_ipv4_val*, [256 x i32]* }
%struct.conn_ipv4_key = type { i32, i32, i16, i16, i16 }
%struct.conn_ipv4_val = type { i32, i32 }
%struct.anon.16 = type { [1 x i32]*, i16*, i16*, [1 x i32]* }
%struct.anon.17 = type { [6 x i32]*, i32*, %struct.datarec*, [5 x i32]* }
%struct.datarec = type { i64, i64 }
%struct.anon.18 = type { [1 x i32]*, i16*, %struct.rules_ipv4*, [256 x i32]* }
%struct.rules_ipv4 = type { i32, i32, i8, i8, i16, i16, i16, i16, i16, i16 }
%struct.anon.19 = type { [1 x i32]*, i16*, %struct.rules_mac*, [256 x i32]* }
%struct.rules_mac = type { [6 x i8], [6 x i8], i16, i16, i16 }
%struct.anon.20 = type { [1 x i32]*, i32*, %struct.rt_item*, [256 x i32]* }
%struct.rt_item = type { i32, [6 x i8], [6 x i8] }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.udphdr = type { i16, i16, i16, i16 }

!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1168, baseType: !7, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "BPF_ANY", value: 0)
!48 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!49 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!50 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 88, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "./common_kern_user.h", directory: "/home/zmx/lmp/eBPF_Supermarket/Network_Subsystem/net_manager", checksumkind: CSK_MD5, checksum: "5b834c38f16dd4e2f6f8b7774a192fc9")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61}
!54 = !DIEnumerator(name: "TCP_S_NONE", value: 0)
!55 = !DIEnumerator(name: "TCP_S_ESTABLISHED", value: 1)
!56 = !DIEnumerator(name: "TCP_S_SYN_SENT", value: 2)
!57 = !DIEnumerator(name: "TCP_S_SYN_RECV", value: 3)
!58 = !DIEnumerator(name: "TCP_S_FIN_WAIT1", value: 4)
!59 = !DIEnumerator(name: "TCP_S_FIN_WAIT2", value: 5)
!60 = !DIEnumerator(name: "TCP_S_CLOSE_WAIT", value: 6)
!61 = !DIEnumerator(name: "TCP_S_CLOSE", value: 7)
!62 = !{!63, !64, !65, !68, !69, !93, !94, !95, !96, !110, !111, !120}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !66, line: 24, baseType: !67)
!66 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !66, line: 27, baseType: !7)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !71, line: 33, size: 128, elements: !72)
!71 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !70, file: !71, line: 40, baseType: !74, size: 128)
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !71, line: 34, size: 128, elements: !75)
!75 = !{!76, !82, !88}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !74, file: !71, line: 35, baseType: !77, size: 128)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !80)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !66, line: 21, baseType: !79)
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81}
!81 = !DISubrange(count: 16)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !74, file: !71, line: 37, baseType: !83, size: 128)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !86)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !85, line: 25, baseType: !65)
!85 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !74, file: !71, line: 38, baseType: !89, size: 128)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !91)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !85, line: 27, baseType: !68)
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "match_rules_loop_ctx", file: !3, line: 170, size: 128, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !97, file: !3, line: 171, baseType: !65, size: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_rule", scope: !97, file: !3, line: 172, baseType: !65, size: 16, offset: 16)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !97, file: !3, line: 173, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_ipv4", file: !52, line: 28, size: 128, elements: !104)
!104 = !{!105, !106, !107, !108, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !103, file: !52, line: 29, baseType: !68, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !103, file: !52, line: 30, baseType: !68, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !103, file: !52, line: 31, baseType: !65, size: 16, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !103, file: !52, line: 32, baseType: !65, size: 16, offset: 80)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !103, file: !52, line: 33, baseType: !65, size: 16, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rt_item", file: !52, line: 62, size: 128, elements: !113)
!113 = !{!114, !115, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !112, file: !52, line: 63, baseType: !68, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "eth_source", scope: !112, file: !52, line: 64, baseType: !116, size: 48, offset: 32)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 48, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 6)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "eth_dest", scope: !112, file: !52, line: 65, baseType: !116, size: 48, offset: 80)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "match_rules_loop_mac_ctx", file: !3, line: 476, size: 128, elements: !122)
!122 = !{!123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !121, file: !3, line: 477, baseType: !65, size: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next_rule", scope: !121, file: !3, line: 478, baseType: !65, size: 16, offset: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !121, file: !3, line: 479, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_mac", file: !52, line: 49, size: 96, elements: !128)
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !127, file: !52, line: 50, baseType: !130, size: 48)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, elements: !117)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !127, file: !52, line: 51, baseType: !130, size: 48, offset: 48)
!132 = !{!133, !142, !190, !196, !204, !210, !390, !396, !398, !404, !406, !408, !413, !418, !426, !432, !435, !448, !468, !493, !0, !509, !517, !526, !553, !558, !560, !565, !570}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !135, line: 1325, type: !136, isLocal: true, isDefinition: true)
!135 = !DIFile(filename: "./lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/zmx/lmp/eBPF_Supermarket/Network_Subsystem/net_manager", checksumkind: CSK_MD5, checksum: "65e4dc8e3121f91a5c2c9eb8563c5692")
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!64, !63, !140, !140}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !66, line: 31, baseType: !141)
!141 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !135, line: 1867, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!64, !63, !148, !189, !68}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 6075, size: 512, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !160, !161, !167, !173, !178, !187, !188}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !149, file: !6, line: 6079, baseType: !78, size: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !149, file: !6, line: 6082, baseType: !78, size: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !149, file: !6, line: 6083, baseType: !84, size: 16, offset: 16)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !149, file: !6, line: 6084, baseType: !84, size: 16, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !149, file: !6, line: 6086, baseType: !156, size: 16, offset: 48)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !6, line: 6086, size: 16, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !156, file: !6, line: 6088, baseType: !65, size: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_result", scope: !156, file: !6, line: 6091, baseType: !65, size: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !149, file: !6, line: 6096, baseType: !68, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !149, file: !6, line: 6098, baseType: !162, size: 32, offset: 96)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !6, line: 6098, size: 32, elements: !163)
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !162, file: !6, line: 6100, baseType: !78, size: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !162, file: !6, line: 6101, baseType: !90, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !162, file: !6, line: 6104, baseType: !68, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, scope: !149, file: !6, line: 6110, baseType: !168, size: 128, offset: 128)
!168 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !6, line: 6110, size: 128, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !168, file: !6, line: 6111, baseType: !90, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !168, file: !6, line: 6112, baseType: !172, size: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !91)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !149, file: !6, line: 6119, baseType: !174, size: 128, offset: 256)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !6, line: 6119, size: 128, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !174, file: !6, line: 6120, baseType: !90, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !174, file: !6, line: 6121, baseType: !172, size: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !149, file: !6, line: 6124, baseType: !179, size: 32, offset: 384)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !6, line: 6124, size: 32, elements: !180)
!180 = !{!181, !186}
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !6, line: 6125, baseType: !182, size: 32)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !179, file: !6, line: 6125, size: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !182, file: !6, line: 6127, baseType: !84, size: 16)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !182, file: !6, line: 6128, baseType: !84, size: 16, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tbid", scope: !179, file: !6, line: 6134, baseType: !68, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !149, file: !6, line: 6137, baseType: !116, size: 48, offset: 416)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !149, file: !6, line: 6138, baseType: !116, size: 48, offset: 464)
!189 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !135, line: 621, type: !192, isLocal: true, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!64, !68, !140}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !135, line: 56, type: !198, isLocal: true, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!63, !63, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !135, line: 78, type: !206, isLocal: true, isDefinition: true)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!64, !63, !202, !202, !140}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "___fmt", scope: !212, file: !3, line: 664, type: !387, isLocal: true, isDefinition: true)
!212 = distinct !DISubprogram(name: "xdp_entry_state", scope: !3, file: !3, line: 603, type: !213, scopeLine: 604, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !224)
!213 = !DISubroutineType(types: !214)
!214 = !{!189, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5461, size: 192, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !6, line: 5462, baseType: !68, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !216, file: !6, line: 5463, baseType: !68, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !216, file: !6, line: 5464, baseType: !68, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !216, file: !6, line: 5466, baseType: !68, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !216, file: !6, line: 5467, baseType: !68, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !216, file: !6, line: 5469, baseType: !68, size: 32, offset: 160)
!224 = !{!225, !226, !227, !228, !229, !234, !235, !243, !271, !293, !302, !326, !327, !328, !336, !346, !351, !356, !359, !361, !365, !369, !371, !378, !385, !386}
!225 = !DILocalVariable(name: "ctx", arg: 1, scope: !212, file: !3, line: 603, type: !215)
!226 = !DILocalVariable(name: "action", scope: !212, file: !3, line: 605, type: !68)
!227 = !DILocalVariable(name: "data_end", scope: !212, file: !3, line: 606, type: !63)
!228 = !DILocalVariable(name: "data", scope: !212, file: !3, line: 607, type: !63)
!229 = !DILocalVariable(name: "nh", scope: !212, file: !3, line: 608, type: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !231, line: 33, size: 64, elements: !232)
!231 = !DIFile(filename: "././common/parsing_helpers.h", directory: "/home/zmx/lmp/eBPF_Supermarket/Network_Subsystem/net_manager", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !230, file: !231, line: 34, baseType: !63, size: 64)
!234 = !DILocalVariable(name: "nh_type", scope: !212, file: !3, line: 609, type: !189)
!235 = !DILocalVariable(name: "eth", scope: !212, file: !3, line: 610, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !238, line: 168, size: 112, elements: !239)
!238 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!239 = !{!240, !241, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !237, file: !238, line: 169, baseType: !130, size: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !237, file: !238, line: 170, baseType: !130, size: 48, offset: 48)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !237, file: !238, line: 171, baseType: !84, size: 16, offset: 96)
!243 = !DILocalVariable(name: "iph", scope: !212, file: !3, line: 611, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !246, line: 87, size: 160, elements: !247)
!246 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !258}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !245, file: !246, line: 89, baseType: !78, size: 4, flags: DIFlagBitField, extraData: i64 0)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !245, file: !246, line: 90, baseType: !78, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !245, file: !246, line: 97, baseType: !78, size: 8, offset: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !245, file: !246, line: 98, baseType: !84, size: 16, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !245, file: !246, line: 99, baseType: !84, size: 16, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !245, file: !246, line: 100, baseType: !84, size: 16, offset: 48)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !245, file: !246, line: 101, baseType: !78, size: 8, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !245, file: !246, line: 102, baseType: !78, size: 8, offset: 72)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !245, file: !246, line: 103, baseType: !257, size: 16, offset: 80)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !85, line: 31, baseType: !65)
!258 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !246, line: 104, baseType: !259, size: 64, offset: 96)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !246, line: 104, size: 64, elements: !260)
!260 = !{!261, !266}
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !246, line: 104, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !259, file: !246, line: 104, size: 64, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !262, file: !246, line: 104, baseType: !90, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !262, file: !246, line: 104, baseType: !90, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !259, file: !246, line: 104, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !259, file: !246, line: 104, size: 64, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !267, file: !246, line: 104, baseType: !90, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !267, file: !246, line: 104, baseType: !90, size: 32, offset: 32)
!271 = !DILocalVariable(name: "tcph", scope: !212, file: !3, line: 612, type: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !274, line: 25, size: 160, elements: !275)
!274 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !273, file: !274, line: 26, baseType: !84, size: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !273, file: !274, line: 27, baseType: !84, size: 16, offset: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !273, file: !274, line: 28, baseType: !90, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !273, file: !274, line: 29, baseType: !90, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !273, file: !274, line: 31, baseType: !65, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !273, file: !274, line: 32, baseType: !65, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !273, file: !274, line: 33, baseType: !65, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !273, file: !274, line: 34, baseType: !65, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !273, file: !274, line: 35, baseType: !65, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !273, file: !274, line: 36, baseType: !65, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !273, file: !274, line: 37, baseType: !65, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !273, file: !274, line: 38, baseType: !65, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !273, file: !274, line: 39, baseType: !65, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !273, file: !274, line: 40, baseType: !65, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !273, file: !274, line: 55, baseType: !84, size: 16, offset: 112)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !273, file: !274, line: 56, baseType: !257, size: 16, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !273, file: !274, line: 57, baseType: !84, size: 16, offset: 144)
!293 = !DILocalVariable(name: "udph", scope: !212, file: !3, line: 613, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !296, line: 23, size: 64, elements: !297)
!296 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!297 = !{!298, !299, !300, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !295, file: !296, line: 24, baseType: !84, size: 16)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !295, file: !296, line: 25, baseType: !84, size: 16, offset: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !295, file: !296, line: 26, baseType: !84, size: 16, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !295, file: !296, line: 27, baseType: !257, size: 16, offset: 48)
!302 = !DILocalVariable(name: "icmph", scope: !212, file: !3, line: 614, type: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !305, line: 89, size: 64, elements: !306)
!305 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 90, baseType: !78, size: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !304, file: !305, line: 91, baseType: !78, size: 8, offset: 8)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !304, file: !305, line: 92, baseType: !257, size: 16, offset: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !304, file: !305, line: 104, baseType: !311, size: 32, offset: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !304, file: !305, line: 93, size: 32, elements: !312)
!312 = !{!313, !318, !319, !324}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !311, file: !305, line: 97, baseType: !314, size: 32)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !311, file: !305, line: 94, size: 32, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !314, file: !305, line: 95, baseType: !84, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !314, file: !305, line: 96, baseType: !84, size: 16, offset: 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !311, file: !305, line: 98, baseType: !90, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !311, file: !305, line: 102, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !311, file: !305, line: 99, size: 32, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !320, file: !305, line: 100, baseType: !84, size: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !320, file: !305, line: 101, baseType: !84, size: 16, offset: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !311, file: !305, line: 103, baseType: !325, size: 32)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 32, elements: !91)
!326 = !DILocalVariable(name: "saddr", scope: !212, file: !3, line: 615, type: !94)
!327 = !DILocalVariable(name: "daddr", scope: !212, file: !3, line: 616, type: !94)
!328 = !DILocalVariable(name: "conn_k", scope: !212, file: !3, line: 619, type: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_ipv4_key", file: !52, line: 75, size: 128, elements: !330)
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !329, file: !52, line: 76, baseType: !68, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !329, file: !52, line: 77, baseType: !68, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !329, file: !52, line: 78, baseType: !65, size: 16, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !329, file: !52, line: 79, baseType: !65, size: 16, offset: 80)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !329, file: !52, line: 80, baseType: !65, size: 16, offset: 96)
!336 = !DILocalVariable(name: "p_conn_v", scope: !337, file: !3, line: 657, type: !341)
!337 = distinct !DILexicalBlock(scope: !338, file: !3, line: 644, column: 31)
!338 = distinct !DILexicalBlock(scope: !339, file: !3, line: 644, column: 7)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 628, column: 38)
!340 = distinct !DILexicalBlock(scope: !212, file: !3, line: 628, column: 6)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conn_ipv4_val", file: !52, line: 83, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_state", scope: !342, file: !52, line: 84, baseType: !68, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rid", scope: !342, file: !52, line: 85, baseType: !68, size: 32, offset: 32)
!346 = !DILocalVariable(name: "conn_v", scope: !347, file: !3, line: 660, type: !342)
!347 = distinct !DILexicalBlock(scope: !348, file: !3, line: 659, column: 31)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 659, column: 8)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 658, column: 17)
!350 = distinct !DILexicalBlock(scope: !337, file: !3, line: 658, column: 7)
!351 = !DILocalVariable(name: "___param", scope: !352, file: !3, line: 664, type: !353)
!352 = distinct !DILexicalBlock(scope: !347, file: !3, line: 664, column: 6)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 768, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 12)
!356 = !DILocalVariable(name: "conn_v", scope: !357, file: !3, line: 670, type: !342)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 669, column: 23)
!358 = distinct !DILexicalBlock(scope: !348, file: !3, line: 669, column: 13)
!359 = !DILocalVariable(name: "___param", scope: !360, file: !3, line: 674, type: !353)
!360 = distinct !DILexicalBlock(scope: !357, file: !3, line: 674, column: 6)
!361 = !DILocalVariable(name: "___param", scope: !362, file: !3, line: 685, type: !353)
!362 = distinct !DILexicalBlock(scope: !363, file: !3, line: 685, column: 5)
!363 = distinct !DILexicalBlock(scope: !364, file: !3, line: 683, column: 17)
!364 = distinct !DILexicalBlock(scope: !337, file: !3, line: 683, column: 7)
!365 = !DILocalVariable(name: "tcp_state_str", scope: !337, file: !3, line: 717, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!369 = !DILocalVariable(name: "___param", scope: !370, file: !3, line: 754, type: !353)
!370 = distinct !DILexicalBlock(scope: !337, file: !3, line: 754, column: 5)
!371 = !DILocalVariable(name: "___param", scope: !372, file: !3, line: 767, type: !375)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 767, column: 4)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 760, column: 34)
!374 = distinct !DILexicalBlock(scope: !338, file: !3, line: 760, column: 11)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 704, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 11)
!378 = !DILocalVariable(name: "___param", scope: !379, file: !3, line: 777, type: !382)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 777, column: 4)
!380 = distinct !DILexicalBlock(scope: !381, file: !3, line: 772, column: 35)
!381 = distinct !DILexicalBlock(scope: !374, file: !3, line: 772, column: 11)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 640, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 10)
!385 = !DILabel(scope: !337, name: "out_tcp_conn", file: !3, line: 720)
!386 = !DILabel(scope: !212, name: "out", file: !3, line: 791)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 448, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 56)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "bpf_trace_vprintk", scope: !2, file: !135, line: 4154, type: !392, isLocal: true, isDefinition: true)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!64, !366, !68, !202, !68}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "___fmt", scope: !212, file: !3, line: 674, type: !387, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !135, line: 88, type: !400, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!64, !63, !202}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "___fmt", scope: !212, file: !3, line: 685, type: !387, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "___fmt", scope: !212, file: !3, line: 754, type: !387, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "___fmt", scope: !212, file: !3, line: 767, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 416, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 52)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "___fmt", scope: !212, file: !3, line: 777, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 440, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 55)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "____fmt", scope: !420, file: !3, line: 799, type: !423, isLocal: true, isDefinition: true)
!420 = distinct !DISubprogram(name: "test", scope: !3, file: !3, line: 797, type: !213, scopeLine: 798, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !421)
!421 = !{!422}
!422 = !DILocalVariable(name: "ctx", arg: 1, scope: !420, file: !3, line: 797, type: !215)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 136, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 17)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !135, line: 177, type: !428, isLocal: true, isDefinition: true)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!64, !366, !68, null}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 803, type: !434, isLocal: false, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 32, elements: !91)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "print_info_map", scope: !2, file: !3, line: 27, type: !437, isLocal: false, isDefinition: true)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 22, size: 256, elements: !438)
!438 = !{!439, !444, !446, !447}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !3, line: 23, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 32, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 1)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !437, file: !3, line: 24, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !437, file: !3, line: 25, baseType: !445, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !437, file: !3, line: 26, baseType: !440, size: 64, offset: 192)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !3, line: 35, type: !450, isLocal: false, isDefinition: true)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 256, elements: !451)
!451 = !{!452, !455, !457, !463}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !3, line: 31, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 192, elements: !117)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !450, file: !3, line: 32, baseType: !456, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !450, file: !3, line: 33, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !52, line: 23, size: 128, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !459, file: !52, line: 24, baseType: !140, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !459, file: !52, line: 25, baseType: !140, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !450, file: !3, line: 34, baseType: !464, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 160, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 5)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "rules_ipv4_map", scope: !2, file: !3, line: 43, type: !470, isLocal: false, isDefinition: true)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 256, elements: !471)
!471 = !{!472, !473, !474, !488}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !470, file: !3, line: 39, baseType: !440, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !470, file: !3, line: 40, baseType: !445, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !470, file: !3, line: 41, baseType: !475, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rules_ipv4", file: !52, line: 36, size: 192, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !476, file: !52, line: 37, baseType: !68, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !476, file: !52, line: 38, baseType: !68, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_mask", scope: !476, file: !52, line: 39, baseType: !78, size: 8, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "daddr_mask", scope: !476, file: !52, line: 40, baseType: !78, size: 8, offset: 72)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !476, file: !52, line: 41, baseType: !65, size: 16, offset: 80)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !476, file: !52, line: 42, baseType: !65, size: 16, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !476, file: !52, line: 43, baseType: !65, size: 16, offset: 112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !476, file: !52, line: 44, baseType: !65, size: 16, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prev_rule", scope: !476, file: !52, line: 45, baseType: !65, size: 16, offset: 144)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next_rule", scope: !476, file: !52, line: 46, baseType: !65, size: 16, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !470, file: !3, line: 42, baseType: !489, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8192, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 256)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "rules_mac_map", scope: !2, file: !3, line: 51, type: !495, isLocal: false, isDefinition: true)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 46, size: 256, elements: !496)
!496 = !{!497, !498, !499, !508}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !3, line: 47, baseType: !440, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !495, file: !3, line: 48, baseType: !445, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !495, file: !3, line: 49, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rules_mac", file: !52, line: 54, size: 144, elements: !502)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !501, file: !52, line: 55, baseType: !130, size: 48)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !501, file: !52, line: 56, baseType: !130, size: 48, offset: 48)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !501, file: !52, line: 57, baseType: !65, size: 16, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev_rule", scope: !501, file: !52, line: 58, baseType: !65, size: 16, offset: 112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next_rule", scope: !501, file: !52, line: 59, baseType: !65, size: 16, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !495, file: !3, line: 50, baseType: !489, size: 64, offset: 192)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "rtcache_map4", scope: !2, file: !3, line: 67, type: !511, isLocal: false, isDefinition: true)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 62, size: 256, elements: !512)
!512 = !{!513, !514, !515, !516}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !511, file: !3, line: 63, baseType: !440, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !511, file: !3, line: 64, baseType: !456, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !511, file: !3, line: 65, baseType: !111, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !511, file: !3, line: 66, baseType: !489, size: 64, offset: 192)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "conn_ipv4_map", scope: !2, file: !3, line: 75, type: !519, isLocal: false, isDefinition: true)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 70, size: 256, elements: !520)
!520 = !{!521, !522, !524, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !3, line: 71, baseType: !440, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !519, file: !3, line: 72, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !519, file: !3, line: 73, baseType: !341, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !519, file: !3, line: 74, baseType: !489, size: 64, offset: 192)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "____fmt", scope: !528, file: !3, line: 213, type: !550, isLocal: true, isDefinition: true)
!528 = distinct !DISubprogram(name: "match_rules_ipv4_loop", scope: !3, file: !3, line: 195, type: !529, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{!189, !68, !63}
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !542, !547, !549}
!532 = !DILocalVariable(name: "index", arg: 1, scope: !528, file: !3, line: 195, type: !68)
!533 = !DILocalVariable(name: "ctx", arg: 2, scope: !528, file: !3, line: 195, type: !63)
!534 = !DILocalVariable(name: "i", scope: !528, file: !3, line: 197, type: !189)
!535 = !DILocalVariable(name: "saddr", scope: !528, file: !3, line: 198, type: !94)
!536 = !DILocalVariable(name: "daddr", scope: !528, file: !3, line: 199, type: !94)
!537 = !DILocalVariable(name: "p_ctx", scope: !528, file: !3, line: 200, type: !96)
!538 = !DILocalVariable(name: "p_r", scope: !528, file: !3, line: 204, type: !475)
!539 = !DILocalVariable(name: "print_info", scope: !540, file: !3, line: 221, type: !110)
!540 = distinct !DILexicalBlock(scope: !541, file: !3, line: 219, column: 2)
!541 = distinct !DILexicalBlock(scope: !528, file: !3, line: 214, column: 6)
!542 = !DILocalVariable(name: "___param", scope: !543, file: !3, line: 227, type: !546)
!543 = distinct !DILexicalBlock(scope: !544, file: !3, line: 227, column: 4)
!544 = distinct !DILexicalBlock(scope: !545, file: !3, line: 223, column: 17)
!545 = distinct !DILexicalBlock(scope: !540, file: !3, line: 223, column: 6)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 320, elements: !466)
!547 = !DILocalVariable(name: "___param", scope: !548, file: !3, line: 228, type: !546)
!548 = distinct !DILexicalBlock(scope: !544, file: !3, line: 228, column: 4)
!549 = !DILabel(scope: !528, name: "out_match_rules_ipv4_loop", file: !3, line: 236)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 200, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 25)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "___fmt", scope: !528, file: !3, line: 227, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 192, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 24)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "___fmt", scope: !528, file: !3, line: 228, type: !555, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "____fmt", scope: !528, file: !3, line: 229, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 232, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 29)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "____fmt", scope: !528, file: !3, line: 230, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 288, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 36)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "bpf_loop", scope: !2, file: !135, line: 4234, type: !572, isLocal: true, isDefinition: true)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!64, !68, !63, !63, !140}
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 54, size: 256, elements: !577)
!577 = !{!578, !583, !585, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !576, file: !3, line: 55, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 448, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 14)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !576, file: !3, line: 56, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !576, file: !3, line: 57, baseType: !584, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !576, file: !3, line: 58, baseType: !489, size: 64, offset: 192)
!587 = !{i32 7, !"Dwarf Version", i32 5}
!588 = !{i32 2, !"Debug Info Version", i32 3}
!589 = !{i32 1, !"wchar_size", i32 4}
!590 = !{i32 7, !"frame-pointer", i32 2}
!591 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!592 = distinct !DISubprogram(name: "xdp_entry_ipv4", scope: !3, file: !3, line: 258, type: !213, scopeLine: 259, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !593)
!593 = !{!594, !595, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!594 = !DILocalVariable(name: "ctx", arg: 1, scope: !592, file: !3, line: 258, type: !215)
!595 = !DILocalVariable(name: "action", scope: !592, file: !3, line: 260, type: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdp_act", file: !52, line: 9, baseType: !68)
!597 = !DILocalVariable(name: "data_end", scope: !592, file: !3, line: 261, type: !63)
!598 = !DILocalVariable(name: "data", scope: !592, file: !3, line: 262, type: !63)
!599 = !DILocalVariable(name: "nh", scope: !592, file: !3, line: 263, type: !230)
!600 = !DILocalVariable(name: "nh_type", scope: !592, file: !3, line: 264, type: !189)
!601 = !DILocalVariable(name: "eth", scope: !592, file: !3, line: 265, type: !236)
!602 = !DILocalVariable(name: "iph", scope: !592, file: !3, line: 266, type: !244)
!603 = !DILocalVariable(name: "tcph", scope: !592, file: !3, line: 267, type: !272)
!604 = !DILocalVariable(name: "udph", scope: !592, file: !3, line: 268, type: !294)
!605 = !DILocalVariable(name: "conn", scope: !592, file: !3, line: 269, type: !103)
!606 = !DILabel(scope: !592, name: "out", file: !3, line: 319)
!607 = !DILocation(line: 0, scope: !592)
!608 = !DILocation(line: 261, column: 38, scope: !592)
!609 = !{!610, !611, i64 4}
!610 = !{!"xdp_md", !611, i64 0, !611, i64 4, !611, i64 8, !611, i64 12, !611, i64 16, !611, i64 20}
!611 = !{!"int", !612, i64 0}
!612 = !{!"omnipotent char", !613, i64 0}
!613 = !{!"Simple C/C++ TBAA"}
!614 = !DILocation(line: 261, column: 27, scope: !592)
!615 = !DILocation(line: 261, column: 19, scope: !592)
!616 = !DILocation(line: 262, column: 34, scope: !592)
!617 = !{!610, !611, i64 0}
!618 = !DILocation(line: 262, column: 23, scope: !592)
!619 = !DILocation(line: 262, column: 15, scope: !592)
!620 = !DILocalVariable(name: "nh", arg: 1, scope: !621, file: !231, line: 124, type: !624)
!621 = distinct !DISubprogram(name: "parse_ethhdr", scope: !231, file: !231, line: 124, type: !622, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!622 = !DISubroutineType(types: !623)
!623 = !{!189, !624, !63, !625}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!626 = !{!620, !627, !628}
!627 = !DILocalVariable(name: "data_end", arg: 2, scope: !621, file: !231, line: 125, type: !63)
!628 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !621, file: !231, line: 126, type: !625)
!629 = !DILocation(line: 0, scope: !621, inlinedAt: !630)
!630 = distinct !DILocation(line: 274, column: 12, scope: !592)
!631 = !DILocalVariable(name: "nh", arg: 1, scope: !632, file: !231, line: 79, type: !624)
!632 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !231, file: !231, line: 79, type: !633, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !642)
!633 = !DISubroutineType(types: !634)
!634 = !{!189, !624, !63, !625, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !231, line: 64, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !636, file: !231, line: 65, baseType: !639, size: 32)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 2)
!642 = !{!631, !643, !644, !645, !646, !647, !648, !654, !655}
!643 = !DILocalVariable(name: "data_end", arg: 2, scope: !632, file: !231, line: 80, type: !63)
!644 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !632, file: !231, line: 81, type: !625)
!645 = !DILocalVariable(name: "vlans", arg: 4, scope: !632, file: !231, line: 82, type: !635)
!646 = !DILocalVariable(name: "eth", scope: !632, file: !231, line: 84, type: !236)
!647 = !DILocalVariable(name: "hdrsize", scope: !632, file: !231, line: 85, type: !189)
!648 = !DILocalVariable(name: "vlh", scope: !632, file: !231, line: 86, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !231, line: 42, size: 32, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !650, file: !231, line: 43, baseType: !84, size: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !650, file: !231, line: 44, baseType: !84, size: 16, offset: 16)
!654 = !DILocalVariable(name: "h_proto", scope: !632, file: !231, line: 87, type: !65)
!655 = !DILocalVariable(name: "i", scope: !632, file: !231, line: 88, type: !189)
!656 = !DILocation(line: 0, scope: !632, inlinedAt: !657)
!657 = distinct !DILocation(line: 129, column: 9, scope: !621, inlinedAt: !630)
!658 = !DILocation(line: 93, column: 14, scope: !659, inlinedAt: !657)
!659 = distinct !DILexicalBlock(scope: !632, file: !231, line: 93, column: 6)
!660 = !DILocation(line: 93, column: 24, scope: !659, inlinedAt: !657)
!661 = !DILocation(line: 93, column: 6, scope: !632, inlinedAt: !657)
!662 = !DILocation(line: 99, column: 17, scope: !632, inlinedAt: !657)
!663 = !{!664, !664, i64 0}
!664 = !{!"short", !612, i64 0}
!665 = !DILocalVariable(name: "h_proto", arg: 1, scope: !666, file: !231, line: 68, type: !65)
!666 = distinct !DISubprogram(name: "proto_is_vlan", scope: !231, file: !231, line: 68, type: !667, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{!189, !65}
!669 = !{!665}
!670 = !DILocation(line: 0, scope: !666, inlinedAt: !671)
!671 = distinct !DILocation(line: 106, column: 8, scope: !672, inlinedAt: !657)
!672 = distinct !DILexicalBlock(scope: !673, file: !231, line: 106, column: 7)
!673 = distinct !DILexicalBlock(scope: !674, file: !231, line: 105, column: 39)
!674 = distinct !DILexicalBlock(scope: !675, file: !231, line: 105, column: 2)
!675 = distinct !DILexicalBlock(scope: !632, file: !231, line: 105, column: 2)
!676 = !DILocation(line: 70, column: 20, scope: !666, inlinedAt: !671)
!677 = !DILocation(line: 70, column: 46, scope: !666, inlinedAt: !671)
!678 = !DILocation(line: 106, column: 8, scope: !672, inlinedAt: !657)
!679 = !DILocation(line: 106, column: 7, scope: !673, inlinedAt: !657)
!680 = !DILocation(line: 112, column: 18, scope: !673, inlinedAt: !657)
!681 = !DILocation(line: 276, column: 5, scope: !592)
!682 = !DILocalVariable(name: "nh", arg: 1, scope: !683, file: !231, line: 151, type: !624)
!683 = distinct !DISubprogram(name: "parse_iphdr", scope: !231, file: !231, line: 151, type: !684, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !687)
!684 = !DISubroutineType(types: !685)
!685 = !{!189, !624, !63, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!687 = !{!682, !688, !689, !690, !691}
!688 = !DILocalVariable(name: "data_end", arg: 2, scope: !683, file: !231, line: 152, type: !63)
!689 = !DILocalVariable(name: "iphdr", arg: 3, scope: !683, file: !231, line: 153, type: !686)
!690 = !DILocalVariable(name: "iph", scope: !683, file: !231, line: 155, type: !244)
!691 = !DILocalVariable(name: "hdrsize", scope: !683, file: !231, line: 156, type: !189)
!692 = !DILocation(line: 0, scope: !683, inlinedAt: !693)
!693 = distinct !DILocation(line: 281, column: 13, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 279, column: 38)
!695 = distinct !DILexicalBlock(scope: !592, file: !3, line: 279, column: 6)
!696 = !DILocation(line: 161, column: 17, scope: !683, inlinedAt: !693)
!697 = !DILocation(line: 161, column: 21, scope: !683, inlinedAt: !693)
!698 = !DILocation(line: 163, column: 13, scope: !699, inlinedAt: !693)
!699 = distinct !DILexicalBlock(scope: !683, file: !231, line: 163, column: 5)
!700 = !DILocation(line: 163, column: 5, scope: !683, inlinedAt: !693)
!701 = !DILocation(line: 167, column: 14, scope: !702, inlinedAt: !693)
!702 = distinct !DILexicalBlock(scope: !683, file: !231, line: 167, column: 6)
!703 = !DILocation(line: 167, column: 24, scope: !702, inlinedAt: !693)
!704 = !DILocation(line: 167, column: 6, scope: !683, inlinedAt: !693)
!705 = !DILocation(line: 173, column: 14, scope: !683, inlinedAt: !693)
!706 = !{!707, !612, i64 9}
!707 = !{!"iphdr", !612, i64 0, !612, i64 0, !612, i64 1, !664, i64 2, !664, i64 4, !664, i64 6, !612, i64 8, !612, i64 9, !664, i64 10, !612, i64 12}
!708 = !DILocation(line: 286, column: 7, scope: !694)
!709 = !DILocalVariable(name: "nh", arg: 1, scope: !710, file: !231, line: 247, type: !624)
!710 = distinct !DISubprogram(name: "parse_tcphdr", scope: !231, file: !231, line: 247, type: !711, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!711 = !DISubroutineType(types: !712)
!712 = !{!189, !624, !63, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!714 = !{!709, !715, !716, !717, !718}
!715 = !DILocalVariable(name: "data_end", arg: 2, scope: !710, file: !231, line: 248, type: !63)
!716 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !710, file: !231, line: 249, type: !713)
!717 = !DILocalVariable(name: "len", scope: !710, file: !231, line: 251, type: !189)
!718 = !DILocalVariable(name: "h", scope: !710, file: !231, line: 252, type: !272)
!719 = !DILocation(line: 0, scope: !710, inlinedAt: !720)
!720 = distinct !DILocation(line: 287, column: 7, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !3, line: 287, column: 7)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 286, column: 31)
!723 = distinct !DILexicalBlock(scope: !694, file: !3, line: 286, column: 7)
!724 = !DILocation(line: 254, column: 8, scope: !725, inlinedAt: !720)
!725 = distinct !DILexicalBlock(scope: !710, file: !231, line: 254, column: 6)
!726 = !DILocation(line: 254, column: 12, scope: !725, inlinedAt: !720)
!727 = !DILocation(line: 254, column: 6, scope: !710, inlinedAt: !720)
!728 = !DILocation(line: 257, column: 11, scope: !710, inlinedAt: !720)
!729 = !DILocation(line: 257, column: 16, scope: !710, inlinedAt: !720)
!730 = !DILocation(line: 259, column: 9, scope: !731, inlinedAt: !720)
!731 = distinct !DILexicalBlock(scope: !710, file: !231, line: 259, column: 5)
!732 = !DILocation(line: 259, column: 5, scope: !710, inlinedAt: !720)
!733 = !DILocation(line: 263, column: 14, scope: !734, inlinedAt: !720)
!734 = distinct !DILexicalBlock(scope: !710, file: !231, line: 263, column: 6)
!735 = !DILocation(line: 263, column: 20, scope: !734, inlinedAt: !720)
!736 = !DILocation(line: 263, column: 6, scope: !710, inlinedAt: !720)
!737 = !DILocalVariable(name: "nh", arg: 1, scope: !738, file: !231, line: 224, type: !624)
!738 = distinct !DISubprogram(name: "parse_udphdr", scope: !231, file: !231, line: 224, type: !739, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!739 = !DISubroutineType(types: !740)
!740 = !{!189, !624, !63, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!742 = !{!737, !743, !744, !745, !746}
!743 = !DILocalVariable(name: "data_end", arg: 2, scope: !738, file: !231, line: 225, type: !63)
!744 = !DILocalVariable(name: "udphdr", arg: 3, scope: !738, file: !231, line: 226, type: !741)
!745 = !DILocalVariable(name: "len", scope: !738, file: !231, line: 228, type: !189)
!746 = !DILocalVariable(name: "h", scope: !738, file: !231, line: 229, type: !294)
!747 = !DILocation(line: 0, scope: !738, inlinedAt: !748)
!748 = distinct !DILocation(line: 295, column: 7, scope: !749)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 295, column: 7)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 294, column: 34)
!751 = distinct !DILexicalBlock(scope: !723, file: !3, line: 294, column: 11)
!752 = !DILocation(line: 231, column: 8, scope: !753, inlinedAt: !748)
!753 = distinct !DILexicalBlock(scope: !738, file: !231, line: 231, column: 6)
!754 = !DILocation(line: 231, column: 14, scope: !753, inlinedAt: !748)
!755 = !DILocation(line: 231, column: 12, scope: !753, inlinedAt: !748)
!756 = !DILocation(line: 231, column: 6, scope: !738, inlinedAt: !748)
!757 = !DILocation(line: 237, column: 8, scope: !738, inlinedAt: !748)
!758 = !{!759, !664, i64 4}
!759 = !{!"udphdr", !664, i64 0, !664, i64 2, !664, i64 4, !664, i64 6}
!760 = !DILocation(line: 238, column: 10, scope: !761, inlinedAt: !748)
!761 = distinct !DILexicalBlock(scope: !738, file: !231, line: 238, column: 6)
!762 = !DILocation(line: 238, column: 6, scope: !738, inlinedAt: !748)
!763 = !DILocation(line: 0, scope: !723)
!764 = !DILocation(line: 305, column: 16, scope: !694)
!765 = !{!612, !612, i64 0}
!766 = !DILocation(line: 305, column: 14, scope: !694)
!767 = !DILocation(line: 306, column: 16, scope: !694)
!768 = !DILocation(line: 306, column: 14, scope: !694)
!769 = !DILocation(line: 307, column: 19, scope: !694)
!770 = !DILocalVariable(name: "ctx", scope: !771, file: !3, line: 246, type: !97)
!771 = distinct !DISubprogram(name: "match_rules_ipv4", scope: !3, file: !3, line: 244, type: !772, scopeLine: 245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!596, !102}
!774 = !{!775, !770, !776}
!775 = !DILocalVariable(name: "conn", arg: 1, scope: !771, file: !3, line: 244, type: !102)
!776 = !DILocalVariable(name: "i", scope: !777, file: !3, line: 249, type: !189)
!777 = distinct !DILexicalBlock(scope: !771, file: !3, line: 249, column: 2)
!778 = !DILocation(line: 246, column: 30, scope: !771, inlinedAt: !779)
!779 = distinct !DILocation(line: 314, column: 12, scope: !694)
!780 = !DILocation(line: 0, scope: !771, inlinedAt: !779)
!781 = !DILocation(line: 0, scope: !777, inlinedAt: !779)
!782 = !DILocation(line: 249, column: 2, scope: !777, inlinedAt: !779)
!783 = !DILocation(line: 0, scope: !528, inlinedAt: !784)
!784 = distinct !DILocation(line: 250, column: 6, scope: !785, inlinedAt: !779)
!785 = distinct !DILexicalBlock(scope: !786, file: !3, line: 250, column: 6)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 249, column: 32)
!787 = distinct !DILexicalBlock(scope: !777, file: !3, line: 249, column: 2)
!788 = !{!611, !611, i64 0}
!789 = !DILocation(line: 197, column: 2, scope: !528, inlinedAt: !784)
!790 = !DILocation(line: 197, column: 6, scope: !528, inlinedAt: !784)
!791 = !DILocation(line: 201, column: 14, scope: !792, inlinedAt: !784)
!792 = distinct !DILexicalBlock(scope: !528, file: !3, line: 201, column: 5)
!793 = !DILocation(line: 201, column: 11, scope: !792, inlinedAt: !784)
!794 = !DILocation(line: 201, column: 5, scope: !528, inlinedAt: !784)
!795 = !DILocation(line: 241, column: 1, scope: !528, inlinedAt: !784)
!796 = !DILocation(line: 250, column: 6, scope: !786, inlinedAt: !779)
!797 = !DILocation(line: 204, column: 27, scope: !528, inlinedAt: !784)
!798 = !DILocation(line: 205, column: 6, scope: !799, inlinedAt: !784)
!799 = distinct !DILexicalBlock(scope: !528, file: !3, line: 205, column: 5)
!800 = !DILocation(line: 205, column: 5, scope: !528, inlinedAt: !784)
!801 = !DILocation(line: 319, column: 1, scope: !592)
!802 = !DILocation(line: 0, scope: !803, inlinedAt: !813)
!803 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !3, file: !3, line: 78, type: !804, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !806)
!804 = !DISubroutineType(types: !805)
!805 = !{!68, !215, !68}
!806 = !{!807, !808, !809, !810, !811, !812}
!807 = !DILocalVariable(name: "ctx", arg: 1, scope: !803, file: !3, line: 78, type: !215)
!808 = !DILocalVariable(name: "action", arg: 2, scope: !803, file: !3, line: 78, type: !68)
!809 = !DILocalVariable(name: "data_end", scope: !803, file: !3, line: 80, type: !63)
!810 = !DILocalVariable(name: "data", scope: !803, file: !3, line: 81, type: !63)
!811 = !DILocalVariable(name: "rec", scope: !803, file: !3, line: 87, type: !458)
!812 = !DILocalVariable(name: "bytes", scope: !803, file: !3, line: 92, type: !140)
!813 = distinct !DILocation(line: 320, column: 9, scope: !592)
!814 = !DILocation(line: 83, column: 6, scope: !803, inlinedAt: !813)
!815 = !DILocation(line: 209, column: 26, scope: !528, inlinedAt: !784)
!816 = !{!817, !664, i64 20}
!817 = !{!"rules_ipv4", !611, i64 0, !611, i64 4, !612, i64 8, !612, i64 9, !664, i64 10, !664, i64 12, !664, i64 14, !664, i64 16, !664, i64 18, !664, i64 20}
!818 = !DILocation(line: 211, column: 5, scope: !819, inlinedAt: !784)
!819 = distinct !DILexicalBlock(scope: !528, file: !3, line: 211, column: 5)
!820 = !DILocation(line: 211, column: 11, scope: !819, inlinedAt: !784)
!821 = !DILocation(line: 211, column: 5, scope: !528, inlinedAt: !784)
!822 = !DILocation(line: 213, column: 2, scope: !823, inlinedAt: !784)
!823 = distinct !DILexicalBlock(scope: !528, file: !3, line: 213, column: 2)
!824 = !DILocation(line: 214, column: 47, scope: !541, inlinedAt: !784)
!825 = !{!817, !611, i64 0}
!826 = !DILocation(line: 214, column: 59, scope: !541, inlinedAt: !784)
!827 = !{!817, !612, i64 8}
!828 = !DILocalVariable(name: "ip_addr", arg: 1, scope: !829, file: !3, line: 177, type: !68)
!829 = distinct !DISubprogram(name: "ipv4_cidr_match", scope: !3, file: !3, line: 177, type: !830, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!189, !68, !68, !78}
!832 = !{!828, !833, !834, !835, !836, !837}
!833 = !DILocalVariable(name: "network_addr", arg: 2, scope: !829, file: !3, line: 177, type: !68)
!834 = !DILocalVariable(name: "cidr", arg: 3, scope: !829, file: !3, line: 177, type: !78)
!835 = !DILocalVariable(name: "subnet_mask", scope: !829, file: !3, line: 181, type: !68)
!836 = !DILocalVariable(name: "masked_ip", scope: !829, file: !3, line: 183, type: !68)
!837 = !DILocalVariable(name: "masked_network", scope: !829, file: !3, line: 184, type: !68)
!838 = !DILocation(line: 0, scope: !829, inlinedAt: !839)
!839 = distinct !DILocation(line: 214, column: 6, scope: !541, inlinedAt: !784)
!840 = !DILocation(line: 178, column: 18, scope: !841, inlinedAt: !839)
!841 = distinct !DILexicalBlock(scope: !829, file: !3, line: 178, column: 5)
!842 = !DILocation(line: 178, column: 23, scope: !841, inlinedAt: !839)
!843 = !DILocation(line: 181, column: 45, scope: !829, inlinedAt: !839)
!844 = !DILocation(line: 181, column: 38, scope: !829, inlinedAt: !839)
!845 = !DILocation(line: 185, column: 22, scope: !829, inlinedAt: !839)
!846 = !DILocation(line: 214, column: 71, scope: !541, inlinedAt: !784)
!847 = !DILocation(line: 215, column: 44, scope: !541, inlinedAt: !784)
!848 = !{!817, !611, i64 4}
!849 = !DILocation(line: 215, column: 56, scope: !541, inlinedAt: !784)
!850 = !{!817, !612, i64 9}
!851 = !DILocation(line: 0, scope: !829, inlinedAt: !852)
!852 = distinct !DILocation(line: 215, column: 3, scope: !541, inlinedAt: !784)
!853 = !DILocation(line: 178, column: 18, scope: !841, inlinedAt: !852)
!854 = !DILocation(line: 178, column: 23, scope: !841, inlinedAt: !852)
!855 = !DILocation(line: 181, column: 45, scope: !829, inlinedAt: !852)
!856 = !DILocation(line: 181, column: 38, scope: !829, inlinedAt: !852)
!857 = !DILocation(line: 185, column: 22, scope: !829, inlinedAt: !852)
!858 = !DILocation(line: 215, column: 68, scope: !541, inlinedAt: !784)
!859 = !DILocation(line: 216, column: 39, scope: !541, inlinedAt: !784)
!860 = !{!817, !664, i64 10}
!861 = !DILocalVariable(name: "conn_port", arg: 1, scope: !862, file: !3, line: 189, type: !65)
!862 = distinct !DISubprogram(name: "port_match", scope: !3, file: !3, line: 189, type: !863, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !865)
!863 = !DISubroutineType(types: !864)
!864 = !{!189, !65, !65}
!865 = !{!861, !866}
!866 = !DILocalVariable(name: "rule_port", arg: 2, scope: !862, file: !3, line: 189, type: !65)
!867 = !DILocation(line: 0, scope: !862, inlinedAt: !868)
!868 = distinct !DILocation(line: 216, column: 3, scope: !541, inlinedAt: !784)
!869 = !DILocation(line: 190, column: 8, scope: !870, inlinedAt: !868)
!870 = distinct !DILexicalBlock(scope: !862, file: !3, line: 190, column: 6)
!871 = !DILocation(line: 216, column: 3, scope: !541, inlinedAt: !784)
!872 = !DILocation(line: 216, column: 46, scope: !541, inlinedAt: !784)
!873 = !DILocation(line: 217, column: 39, scope: !541, inlinedAt: !784)
!874 = !{!817, !664, i64 12}
!875 = !DILocation(line: 0, scope: !862, inlinedAt: !876)
!876 = distinct !DILocation(line: 217, column: 3, scope: !541, inlinedAt: !784)
!877 = !DILocation(line: 190, column: 8, scope: !870, inlinedAt: !876)
!878 = !DILocation(line: 217, column: 3, scope: !541, inlinedAt: !784)
!879 = !DILocation(line: 217, column: 46, scope: !541, inlinedAt: !784)
!880 = !DILocation(line: 218, column: 42, scope: !541, inlinedAt: !784)
!881 = !{!817, !664, i64 14}
!882 = !DILocation(line: 0, scope: !862, inlinedAt: !883)
!883 = distinct !DILocation(line: 218, column: 3, scope: !541, inlinedAt: !784)
!884 = !DILocation(line: 190, column: 8, scope: !870, inlinedAt: !883)
!885 = !DILocation(line: 218, column: 3, scope: !541, inlinedAt: !784)
!886 = !DILocation(line: 214, column: 6, scope: !528, inlinedAt: !784)
!887 = !DILocation(line: 220, column: 24, scope: !540, inlinedAt: !784)
!888 = !{!817, !664, i64 16}
!889 = !DILocation(line: 221, column: 27, scope: !540, inlinedAt: !784)
!890 = !DILocation(line: 0, scope: !540, inlinedAt: !784)
!891 = !DILocation(line: 222, column: 7, scope: !892, inlinedAt: !784)
!892 = distinct !DILexicalBlock(scope: !540, file: !3, line: 222, column: 6)
!893 = !DILocation(line: 222, column: 6, scope: !540, inlinedAt: !784)
!894 = !DILocation(line: 254, column: 9, scope: !771, inlinedAt: !779)
!895 = !DILocation(line: 227, column: 4, scope: !543, inlinedAt: !784)
!896 = !{!897, !897, i64 0}
!897 = !{!"long long", !612, i64 0}
!898 = !DILocation(line: 227, column: 4, scope: !544, inlinedAt: !784)
!899 = !DILocation(line: 228, column: 4, scope: !548, inlinedAt: !784)
!900 = !DILocation(line: 228, column: 4, scope: !544, inlinedAt: !784)
!901 = !DILocation(line: 229, column: 4, scope: !902, inlinedAt: !784)
!902 = distinct !DILexicalBlock(scope: !544, file: !3, line: 229, column: 4)
!903 = !DILocation(line: 230, column: 4, scope: !904, inlinedAt: !784)
!904 = distinct !DILexicalBlock(scope: !544, file: !3, line: 230, column: 4)
!905 = !DILocation(line: 233, column: 3, scope: !540, inlinedAt: !784)
!906 = !DILocation(line: 237, column: 10, scope: !907, inlinedAt: !784)
!907 = distinct !DILexicalBlock(scope: !528, file: !3, line: 237, column: 5)
!908 = !DILocation(line: 236, column: 1, scope: !528, inlinedAt: !784)
!909 = !DILocation(line: 237, column: 20, scope: !907, inlinedAt: !784)
!910 = !DILocation(line: 249, column: 29, scope: !787, inlinedAt: !779)
!911 = !DILocation(line: 249, column: 16, scope: !787, inlinedAt: !779)
!912 = distinct !{!912, !782, !913, !914}
!913 = !DILocation(line: 252, column: 2, scope: !777, inlinedAt: !779)
!914 = !{!"llvm.loop.mustprogress"}
!915 = !DILocation(line: 83, column: 13, scope: !916, inlinedAt: !813)
!916 = distinct !DILexicalBlock(scope: !803, file: !3, line: 83, column: 6)
!917 = !DILocation(line: 80, column: 38, scope: !803, inlinedAt: !813)
!918 = !DILocation(line: 81, column: 38, scope: !803, inlinedAt: !813)
!919 = !DILocation(line: 87, column: 24, scope: !803, inlinedAt: !813)
!920 = !DILocation(line: 88, column: 7, scope: !921, inlinedAt: !813)
!921 = distinct !DILexicalBlock(scope: !803, file: !3, line: 88, column: 6)
!922 = !DILocation(line: 88, column: 6, scope: !803, inlinedAt: !813)
!923 = !DILocation(line: 80, column: 27, scope: !803, inlinedAt: !813)
!924 = !DILocation(line: 81, column: 27, scope: !803, inlinedAt: !813)
!925 = !DILocation(line: 92, column: 25, scope: !803, inlinedAt: !813)
!926 = !DILocation(line: 98, column: 7, scope: !803, inlinedAt: !813)
!927 = !DILocation(line: 98, column: 17, scope: !803, inlinedAt: !813)
!928 = !{!929, !897, i64 0}
!929 = !{!"datarec", !897, i64 0, !897, i64 8}
!930 = !DILocation(line: 99, column: 7, scope: !803, inlinedAt: !813)
!931 = !DILocation(line: 99, column: 16, scope: !803, inlinedAt: !813)
!932 = !{!929, !897, i64 8}
!933 = !DILocation(line: 101, column: 9, scope: !803, inlinedAt: !813)
!934 = !DILocation(line: 102, column: 1, scope: !803, inlinedAt: !813)
!935 = !DILocation(line: 320, column: 2, scope: !592)
!936 = distinct !DISubprogram(name: "xdp_entry_router", scope: !3, file: !3, line: 328, type: !213, scopeLine: 329, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945, !946, !973, !974, !975, !976, !977, !981, !982}
!938 = !DILocalVariable(name: "ctx", arg: 1, scope: !936, file: !3, line: 328, type: !215)
!939 = !DILocalVariable(name: "action", scope: !936, file: !3, line: 330, type: !596)
!940 = !DILocalVariable(name: "data_end", scope: !936, file: !3, line: 331, type: !63)
!941 = !DILocalVariable(name: "data", scope: !936, file: !3, line: 332, type: !63)
!942 = !DILocalVariable(name: "ifib", scope: !936, file: !3, line: 333, type: !149)
!943 = !DILocalVariable(name: "nh", scope: !936, file: !3, line: 334, type: !230)
!944 = !DILocalVariable(name: "nh_type", scope: !936, file: !3, line: 335, type: !189)
!945 = !DILocalVariable(name: "eth", scope: !936, file: !3, line: 336, type: !236)
!946 = !DILocalVariable(name: "ip6h", scope: !936, file: !3, line: 337, type: !947)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !949, line: 118, size: 320, elements: !950)
!949 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "9926d49458ea1e0cc4651362e733e03e")
!950 = !{!951, !952, !953, !957, !958, !959, !960}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !948, file: !949, line: 120, baseType: !78, size: 4, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !948, file: !949, line: 121, baseType: !78, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !948, file: !949, line: 128, baseType: !954, size: 24, offset: 8)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 24, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 3)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !948, file: !949, line: 130, baseType: !84, size: 16, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !948, file: !949, line: 131, baseType: !78, size: 8, offset: 48)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !948, file: !949, line: 132, baseType: !78, size: 8, offset: 56)
!960 = !DIDerivedType(tag: DW_TAG_member, scope: !948, file: !949, line: 134, baseType: !961, size: 256, offset: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !948, file: !949, line: 134, size: 256, elements: !962)
!962 = !{!963, !968}
!963 = !DIDerivedType(tag: DW_TAG_member, scope: !961, file: !949, line: 134, baseType: !964, size: 256)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !961, file: !949, line: 134, size: 256, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !964, file: !949, line: 134, baseType: !70, size: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !964, file: !949, line: 134, baseType: !70, size: 128, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !961, file: !949, line: 134, baseType: !969, size: 256)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !961, file: !949, line: 134, size: 256, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !969, file: !949, line: 134, baseType: !70, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !969, file: !949, line: 134, baseType: !70, size: 128, offset: 128)
!973 = !DILocalVariable(name: "iph", scope: !936, file: !3, line: 338, type: !244)
!974 = !DILocalVariable(name: "ip4_saddr", scope: !936, file: !3, line: 339, type: !7)
!975 = !DILocalVariable(name: "rc", scope: !936, file: !3, line: 341, type: !189)
!976 = !DILocalVariable(name: "nitem", scope: !936, file: !3, line: 342, type: !112)
!977 = !DILocalVariable(name: "src", scope: !978, file: !3, line: 422, type: !69)
!978 = distinct !DILexicalBlock(scope: !979, file: !3, line: 419, column: 47)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 419, column: 13)
!980 = distinct !DILexicalBlock(scope: !936, file: !3, line: 352, column: 6)
!981 = !DILocalVariable(name: "dst", scope: !978, file: !3, line: 423, type: !69)
!982 = !DILabel(scope: !936, name: "out", file: !3, line: 472)
!983 = !DILocation(line: 0, scope: !936)
!984 = !DILocation(line: 331, column: 38, scope: !936)
!985 = !DILocation(line: 331, column: 27, scope: !936)
!986 = !DILocation(line: 331, column: 19, scope: !936)
!987 = !DILocation(line: 332, column: 34, scope: !936)
!988 = !DILocation(line: 332, column: 23, scope: !936)
!989 = !DILocation(line: 332, column: 15, scope: !936)
!990 = !DILocation(line: 333, column: 2, scope: !936)
!991 = !DILocation(line: 333, column: 24, scope: !936)
!992 = !DILocation(line: 342, column: 2, scope: !936)
!993 = !DILocation(line: 342, column: 17, scope: !936)
!994 = !DILocation(line: 0, scope: !621, inlinedAt: !995)
!995 = distinct !DILocation(line: 347, column: 12, scope: !936)
!996 = !DILocation(line: 0, scope: !632, inlinedAt: !997)
!997 = distinct !DILocation(line: 129, column: 9, scope: !621, inlinedAt: !995)
!998 = !DILocation(line: 93, column: 14, scope: !659, inlinedAt: !997)
!999 = !DILocation(line: 93, column: 24, scope: !659, inlinedAt: !997)
!1000 = !DILocation(line: 93, column: 6, scope: !632, inlinedAt: !997)
!1001 = !DILocation(line: 97, column: 10, scope: !632, inlinedAt: !997)
!1002 = !DILocation(line: 99, column: 17, scope: !632, inlinedAt: !997)
!1003 = !DILocation(line: 0, scope: !666, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 106, column: 8, scope: !672, inlinedAt: !997)
!1005 = !DILocation(line: 70, column: 20, scope: !666, inlinedAt: !1004)
!1006 = !DILocation(line: 70, column: 46, scope: !666, inlinedAt: !1004)
!1007 = !DILocation(line: 106, column: 8, scope: !672, inlinedAt: !997)
!1008 = !DILocation(line: 106, column: 7, scope: !673, inlinedAt: !997)
!1009 = !DILocation(line: 112, column: 18, scope: !673, inlinedAt: !997)
!1010 = !DILocation(line: 352, column: 6, scope: !936)
!1011 = !DILocation(line: 0, scope: !683, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 353, column: 13, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !980, file: !3, line: 352, column: 38)
!1014 = !DILocation(line: 158, column: 10, scope: !1015, inlinedAt: !1012)
!1015 = distinct !DILexicalBlock(scope: !683, file: !231, line: 158, column: 6)
!1016 = !DILocation(line: 158, column: 14, scope: !1015, inlinedAt: !1012)
!1017 = !DILocation(line: 158, column: 6, scope: !683, inlinedAt: !1012)
!1018 = !DILocation(line: 161, column: 17, scope: !683, inlinedAt: !1012)
!1019 = !DILocation(line: 161, column: 21, scope: !683, inlinedAt: !1012)
!1020 = !DILocation(line: 163, column: 13, scope: !699, inlinedAt: !1012)
!1021 = !DILocation(line: 163, column: 5, scope: !683, inlinedAt: !1012)
!1022 = !DILocation(line: 167, column: 14, scope: !702, inlinedAt: !1012)
!1023 = !DILocation(line: 167, column: 24, scope: !702, inlinedAt: !1012)
!1024 = !DILocation(line: 167, column: 6, scope: !683, inlinedAt: !1012)
!1025 = !DILocation(line: 359, column: 12, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 359, column: 7)
!1027 = !{!707, !612, i64 8}
!1028 = !DILocation(line: 359, column: 16, scope: !1026)
!1029 = !DILocation(line: 359, column: 7, scope: !1013)
